namespace FiscalDeviceStatusDecoder.Domain;

/// <inheritdoc/>
public sealed class Eltrade : BaseManufacturer
{
    private static readonly Lazy<Eltrade> lazy = new Lazy<Eltrade>(() => new Eltrade());

    private Eltrade()
    {
    }

    public static Eltrade Instance => lazy.Value;

    public override string Name => nameof(Eltrade);
    public override Dictionary<(string[], Country), Dictionary<(int, int), string>>? AllModels => throw new NotImplementedException();

    #region Documents

    public override Dictionary<(int, int), string>? DefaultDocument => new()
            {
                { (0,1), "Отворен е капакът на принтера" },
                { (0,2), "Обща грешка - това е OR на всички грешки, маркирани с ‘#’" },
                { (0,3), "# Механизмът на печатащото устройство има неизправност" },
                { (0,4), "Не е свързан клиентски дисплей" },
                { (0,5), "Часовникът не е установен" },
                { (0,6), "# Кодът на получената команда е невалиден" },
                { (0,7), "# Получените данни имат синтактична грешка" },

                { (1,1), "Вграденият данъчен терминал не отговаря" },
                { (1,2), "Отворен е служебен бон за печат на завъртян на 90 градуса текст" },
                { (1,3), "# Установено е разрушаване на съдържанието на оперативната памет (RAM) след включване" },
                { (1,4), "# Слаба батерия (Часовникът за реално време е в състояние RESET)" },
                { (1,5), "# Извършено е зануляване на оперативната памет" },
                { (1,6), "# Изпълнението на командата не е позволено в текущия фискален режим" },
                { (1,7), "При изпълнение на командата се е получило препълване на някои полета от сумите. \n " +
                           "Статус 1.1 също ще се установи и командата няма да предизвика промяна на данните в принтера" },

                { (2,2), "Отворен е служебен бон" },
                { (2,3), "Близък край на КЛЕН (по-малко от 10 MB от КЛЕН свободни)." },
                { (2,4), "Отворен е фискален бон" },
                { (2,5), "Край на КЛЕН (по-малко от 1 MB от КЛЕН свободни)" },
                { (2,6), "Останала е малко хартия" },
                { (2,7), "# Свършила е хартията. Ако се вдигне този флаг по време на команда, свързана с печат," +
                            "\n то командата е отхвърлена и не е променила състоянието на принтера" },

                { (3,1), "Състояние на Sw7" },
                { (3,2), "Състояние на Sw6" },
                { (3,3), "Състояние на Sw5" },
                { (3,4), "Състояние на Sw4" },
                { (3,5), "Състояние на Sw3" },
                { (3,6), "Състояние на Sw2" },
                { (3,7), "Състояние на Sw1" },

                { (4,2), "OR на всички грешки, маркирани с ‘*’ от байтове 4 и 5" },
                { (4,3), "* Фискалната памет е пълна" },
                { (4,4), "Има място за по-малко от 50 записа във ФП" },
                { (4,5), "Зададени са индивидуален номер на принтера и номер на фискалната памет" },
                { (4,6), "Зададен е ЕИК" },
                { (4,7), "* Има грешка при запис във фискалната памет" },

                { (5,2), "Грешка при четене от фискалната памет" },
                { (5,3), "Зададени са поне веднъж данъчните ставки" },
                { (5,4), "Принтерът е във фискален режим" },
                { (5,5), "* Последният запис във фискалната памет не е успешен" },
                { (5,6), "Фискалната памет е форматирана" },
                { (5,7), "* Фискалната памет е установена в режим READONLY (заключена)" },
            };

    #endregion Documents
}